/*==============================================================================
 *
 *   Hlcd158 Drive Module
 *
 *        File Name   		: lcd_hlcd158.c 
 *        Version        	: 2.0
 *        Date           	: 2005.11.19
 *        Author         	: Yoonseok Pyo (ROLAB 19th, Kwangwoon University)
 *        MPU_Type       	: ATmega128(16MHz)
 *        Modified       	: 2006.02.08 By P.Y.S
 *        Copyright(c) 1985 - 2006 ROLAB, Kwangwoon University. 
 *        All Rights Reserved.
 *
==============================================================================*/

#include <iom128.h>
#include "../define.h"
#include "../delay.h"
#include "../AVRLIB/Uart.h"
#include "lcd_hlcd158.h"

//------------------------------------------------------------------------------
//					===== Gloval Variable Number =====
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
//					===== HLCD158 초기화 =====
//------------------------------------------------------------------------------
void Hlcd158_Init(void)
{
     DelayU16(60000);                       	// 시간지연
     Uart_Putch(UART1,0xa0);     			// HLCD158 초기화
     DelayU16(60000);                       	// 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 화면클리어 =====
//------------------------------------------------------------------------------
void Hlcd158_Clear(void)
{
     Uart_Putch(UART1,0xa3);                 // HLCD158 화면클리어
     Uart_Putch(UART1,0x01);                 // 
     DelayU16(10000);                        // 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 9*16 샘물체 폰트 설정 =====
//------------------------------------------------------------------------------
void Hlcd158_font_A(void)
{
     Uart_Putch(UART1,0xB0);                 // 9*16 샘물체 폰트 설정
     Uart_Putch(UART1,0x00);                 // 
     DelayU16(10000);                        // 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 9*16 고딕체 폰트 설정 =====
//------------------------------------------------------------------------------
void Hlcd158_font_B(void)
{
     Uart_Putch(UART1,0xB0);                 // 9*16 고딕체 폰트 설정
     Uart_Putch(UART1,0x01);                 // 
     DelayU16(10000);                        // 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 반전 ON =====
//------------------------------------------------------------------------------
void Hlcd158_Inversion_ON(void)
{
     Uart_Putch(UART1,0xD0);                 // HLCD158 반전 ON
     Uart_Putch(UART1,0x01);                 // 
     DelayU16(10000);                        // 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 반전 OFF =====
//------------------------------------------------------------------------------
void Hlcd158_Inversion_OFF(void)
{
     Uart_Putch(UART1,0xD0);                 // HLCD158 반전 OFF
     Uart_Putch(UART1,0x00);                 // 
     DelayU16(10000);                        // 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 완성형 한글 코드 =====
//------------------------------------------------------------------------------
void Hlcd158_KS_A(void)
{
     Uart_Putch(UART1,0xE0);                 // HLCD158 완성형 한글 코드 설정
     Uart_Putch(UART1,0x01);                 // 
     DelayU16(10000);                        // 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 조합형 한글 코드 =====
//------------------------------------------------------------------------------
void Hlcd158_KS_B(void)
{
     Uart_Putch(UART1,0xE0);                 // HLCD158 완성형 한글 코드 설정
     Uart_Putch(UART1,0x00);                 // 
     DelayU16(10000);                        // 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 표시위치 설정 =====
//------------------------------------------------------------------------------
void Hlcd158_Locate(U8 Locate_X,U8 Locate_Y)
{
     Uart_Putch(UART1,0xa1);                 // HLCD158 표시위치 설정
	Uart_Putch(UART1,Locate_X);             // X축 좌표설정
	Uart_Putch(UART1,Locate_Y);             // Y축 좌표설정
	DelayU16(10000);                        // 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 글자표시 =====
//------------------------------------------------------------------------------
void Hlcd158_PrintString(char *PrintString)
{
	Uart_Putch(UART1,0xa2);                 // HLCD158 글자표시
	Uart_Print(UART1,PrintString);        	// HLCD158 글자데이터
	Uart_Putch(UART1,0x00);                 // HLCD158 글자표시 종료
     DelayU16(10000);                        // 시간지연
}

//------------------------------------------------------------------------------
// 					===== HLCD158 8BIT숫자표시 =====
//------------------------------------------------------------------------------
void Hlcd158_Print8BitNum(U8 Print8BitNum)
{
	Uart_Putch(UART1,0xa2);                 // HLCD158 숫자표시
     Uart_U8Bit_PutNum(UART1, Print8BitNum);
	Uart_Putch(UART1,0x00);                 // HLCD158 숫자표시 종료
}

//------------------------------------------------------------------------------
// 					===== HLCD158 8BI실질적인숫자표시 =====
//------------------------------------------------------------------------------
void Hlcd158_Print8BitNum_Substance(U8 Print8BitNum)
{
	Uart_Putch(UART1,0xa2);                 // HLCD158 숫자표시
     Uart_U8Bit_PutNum_Substance(UART1, Print8BitNum);
	Uart_Putch(UART1,0x00);                 // HLCD158 숫자표시 종료
}

//------------------------------------------------------------------------------
// 					===== HLCD158 16BIT숫자표시 =====
//------------------------------------------------------------------------------
void Hlcd158_Print16BitNum(U16 Print16BitNum)
{
	Uart_Putch(UART1,0xa2);                 // HLCD158 숫자표시
     Uart_U16Bit_PutNum(UART1, Print16BitNum);
	Uart_Putch(UART1,0x00);                 // HLCD158 숫자표시 종료
}

//------------------------------------------------------------------------------
// 					===== HLCD158 그래픽표시 =====
//------------------------------------------------------------------------------
void Hlcd158_Graphic()
{
	U8 i=0;
	U8 Heart[32] = 
	{
		0x00,0x00,0x00,0x00,0x70,0x0E,0x8C,0x31,
		0x04,0x20,0x02,0x40,0x02,0x40,0x04,0x20,
		0x04,0x20,0x08,0x10,0x08,0x10,0x30,0x0C,
		0x40,0x02,0x80,0x01,0x80,0x01,0x00,0x00
	};
     
	Uart_Putch(UART1,0xa4);                 // HLCD158 그래픽표시
	
	for(i=0;i<32;i++)                       // 16*16 그래픽출력
	{
	     Uart_Putch(UART1,Heart[i]);
	}
}
